import * as yup from "yup";

export const validationSchema = yup.object({
    name: yup
        .string("نام خود را به درستی وارد نمایید!")
        .required("واردکردن نام الزامی است!")
        .matches(/^[a-zA-Z]*$/, "از حروف انگلیسی استفاده نمایید!")
        .min(3, "نام حداقل باید شامل 3 کارکتر باشد!")
        .max(12, "نام حداکثر باید شامل 18 کارکتر باشد!"),

    mobile: yup
        .string("شماره تماس خود را وارد نمایید!")
        .matches(/^09[0|1|2|3|9][0-9]*$/, "ساختار وارد شده اشتباه است!")
        .min(11, "شماره تماس کمتر از حد مجاز است!")
        .max(11, "شماره تماس بیشتر از حد مجاز است!")
        .required("وارد کردن شماره تماس الزامی است!"),

    id: yup
        .string("شماره ملی خود را وارد نمایید!")
        .matches(/^[0-9]*$/, "ساختار وارد شده اشتباه است!")
        .min(10, "شماره ملی باید حداقل 10 کارکتر باشد!")
        .required("وارد کردن شماره ملی الزامی است!"),

    email: yup
        .string("ایمیل خود را وارد نمایید!")
        .email("ایمیل خود را به درستی وارد نمایید!")
        .required("وارد کردن ایمیل الزامی است!"),

    password: yup
        .string("رمز خود را وارد نمایید!")
        .required("وارد کردن رمزعبور الزامی است! ")
        .min(8, "رمزعبور باید حداقل 8 کارکتر باشد!")
        .matches(
            /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,}$/,
            "رمزعبور به اندازه‌ی کافی قوی نیست!"
        ),

    passwordNew: yup
        .string("رمز جدید خود را وارد نمایید!")
        .required("رمز عبور وارد نکرده اید!")
        .min(8, "رمزعبور باید حداقل 8 کارکتر باشد!")
        .matches(
            /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,}$/,
            "رمزعبور به اندازه‌ی کافی قوی نیست!"
        ),
    againPasswordNew: yup
        .string("دوباره رمز جدید خود را وارد نمایید!")
        .required("رمز عبور وارد نکرده اید!")
        .min(8, "رمزعبور باید حداقل 8 کارکتر باشد!")
        .matches(
            /^(?=.*?[A-Z])(?=.*?[a-z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,}$/,
            "رمزعبور به اندازه‌ی کافی قوی نیست!"
        )
        .oneOf([yup.ref("passwordNew"), null], "تکرار رمز عبور اشتباه است!"),
});